#!/bin/bash

# This script is designed to help you clean your computer from unneeded
# packages. The script will find all packages that no other installed package
# depends on. It will output this list of packages excluding any you have
# placed in the ignore list. You may browse through the script's output and
# remove any packages you do not need.

# Enter groups and packages here which you know you wish to keep. They will
# not be included in the list of unrequired packages later.
ignoregrp="base base-devel xfce4 xfce4-goodies xorg texlive-most"
ignorepkg="
firefox
google-chrome
acpi
adobe-source-code-pro-fonts
alsa-utils
bc
beamer-theme-metropolis
bind-tools
bitwig-studio-demo
ccid
dmenu2
efivar
elixir
feh
flashplugin
geary
gvim
htop
i3lock
inotify-tools
iw
lastpass
minecraft
mpv
mupdf
ntfs-3g
net-tools
opensc
openssh
pacaur
pandoc-bin
pcsc-tools
pkgfile
postgresql
pygmentize
rsync
rxvt-unicode
scrot
spotify
stow
sxhkd
traceroute
transmission-gtk
tree
ttf-inconsolata
ttf-inconsolata-g
ttf-mac-fonts
ttf-roboto
ufw
unzip
whois
wkhtmltopdf-static
wget
xcape
xclip
xorg-xinit
zip
zsh
"

comm -23 <(pacman -Qqt | sort) <(echo $ignorepkg | tr ' ' '\n' | cat <(pacman -Sqg $ignoregrp) - | sort -u)
